app/controllers/funcionarios_controller.rb

SELECT "funcionarios".* FROM "funcionarios"
---
  def index
    @funcionarios = Funcionario.all

SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @funcionario = Funcionario.find(params[:id])

SELECT "departamentos".* FROM "departamentos"
---
  def new
    @departamentos = Departamento.all

SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "departamentos".* FROM "departamentos"
---
  def edit
    @funcionario = Funcionario.find(params[:id])
    @departamentos = Departamento.all

INSERT INTO "funcionarios" ("ativo", "contratacao", "created_at", "departamento_id", "nome", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "departamentos".* FROM "departamentos"
---
  def create
    @funcionario = Funcionario.new(params[:funcionario])
    @funcionario.contratacao = string_to_date(params[:funcionario][:contratacao])

    p @funcionario

    respond_to do |format|
      if @funcionario.save
        format.html {redirect_to @funcionario, notice: 'Funcionário adicionado com sucesso.' }
      else
        @departamentos = Departamento.all

SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "funcionarios" SET "contratacao" = '2012-02-01', "updated_at" = '2013-03-19 12:43:00.990261' WHERE "funcionarios"."id" = 3
SELECT "departamentos".* FROM "departamentos"
---
  def update
    @funcionario = Funcionario.find(params[:id])

    if @funcionario.update_attributes(params[:funcionario])
      redirect_to @funcionario, notice: 'Funcionário atualizado com sucesso!'
    else
      @departamentos = Departamento.all

SELECT "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "funcionarios" WHERE "funcionarios"."id" = ?  [["id", 3]]
---
  def destroy
    @funcionario = Funcionario.find(params[:id])
    @funcionario.destroy