app/views/funcionarios/_form.html.erb

    	<div class="controls">
			<%= f.select :departamento_id, options_from_collection_for_select(@departamentos, 'id', 'nome', @funcionario.departamento_id) %>
---
SELECT "departamentos".* FROM "departamentos"